/*Проект 2: Банковский счёт
Задачи:
1- Создай класс или фабричную функцию для банковского счёта:
    Счёт должен иметь свойства: имя владельца (owner), баланс (balance) и номер счёта (accountNumber).
    Добавь методы для пополнения (deposit) и снятия (withdraw) средств.
2 - Добавь геттеры/сеттеры для доступа к данным:
    Например, создай геттер для баланса и сеттер для имени владельца.
3 - Используй деструктуризацию для работы с данными:
    Например, при выводе информации о счёте.
4 - Добавь несколько счётов и реализуй банк:
    Создай объект или класс для банка, который будет хранить все счёта.
    Добавь методы для добавления, удаления и поиска счёта.*/
